; ModuleID = 'main.7rcbfp3g-cgu.0'
source_filename = "main.7rcbfp3g-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { [0 x i64], { i64, i64 }, [0 x i64], { i64, i64 }, [0 x i64], { {}*, [3 x i64]* }, [0 x i64], { i64*, i64* }, [0 x i64], { [0 x { i8*, i8* }]*, i64 }, [0 x i32], i32, [0 x i32], i32, [0 x i8], i8, [7 x i8] }
%"core::fmt::Void" = type { [0 x i8], {}, [0 x i8], %"core::marker::PhantomData<*mut core::ops::function::Fn<(), Output=()>>", [0 x i8] }
%"core::marker::PhantomData<*mut core::ops::function::Fn<(), Output=()>>" = type {}
%"core::fmt::Arguments" = type { [0 x i64], { [0 x { [0 x i8]*, i64 }]*, i64 }, [0 x i64], { i64*, i64 }, [0 x i64], { [0 x { i8*, i8* }]*, i64 }, [0 x i64] }
%"core::fmt::rt::v1::Argument" = type { [0 x i64], { i64, i64 }, [0 x i64], %"core::fmt::rt::v1::FormatSpec", [0 x i64] }
%"core::fmt::rt::v1::FormatSpec" = type { [0 x i64], { i64, i64 }, [0 x i64], { i64, i64 }, [0 x i32], i32, [0 x i32], i32, [0 x i8], i8, [7 x i8] }
%"unwind::libunwind::_Unwind_Exception" = type { [0 x i64], i64, [0 x i64], void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [0 x i64], [6 x i64], [0 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }


!34 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17he8f5f9e82f478b04E", scope: !36, file: !35, line: 61, type: !38, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !43, retainedNodes: !4)
!35 = !DIFile(filename: "/home/xftroxgpx/build/2nonpkgs/rust.stuff/rust/rust/src/libstd/rt.rs", directory: "")
!36 = !DINamespace(name: "rt", scope: !37)
!37 = !DINamespace(name: "std", scope: null)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !8, !40, !41}
!40 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !20, size: 64, align: 64)
!43 = !{!44}
!44 = !DITemplateTypeParameter(name: "T", type: !45)
!45 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!46 = !DILocalVariable(name: "main", arg: 1, scope: !34, file: !47, line: 1, type: !8)
!47 = !DIFile(filename: "./src/main.rs", directory: "")
!48 = !DILocation(line: 1, scope: !34)
!49 = !DILocalVariable(name: "argc", arg: 2, scope: !34, file: !47, line: 1, type: !40)
!50 = !DILocalVariable(name: "argv", arg: 3, scope: !34, file: !47, line: 1, type: !41)
!51 = !DILocation(line: 64, column: 25, scope: !34)
!52 = !DILocation(line: 64, column: 24, scope: !34)
!53 = !DILocation(line: 64, column: 50, scope: !34)
!54 = !DILocation(line: 64, column: 56, scope: !34)
!55 = !DILocation(line: 64, column: 4, scope: !34)
!56 = !DILocation(line: 65, column: 1, scope: !34)
!57 = distinct !DISubprogram(name: "{{closure}}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17he828a9bd8659b11aE", scope: !58, file: !35, line: 64, type: !59, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !43, retainedNodes: !4)
!58 = !DINamespace(name: "lang_start", scope: !36)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !62}
!61 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&closure", baseType: !5, size: 64, align: 64)
!63 = !DILocalVariable(name: "main", scope: !57, file: !47, line: 1, type: !8, align: 8)
!64 = !DILocation(line: 1, scope: !57)
!65 = !DILocation(line: 64, column: 33, scope: !57)
!66 = !DILocation(line: 64, column: 48, scope: !57)
!67 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217ha49dfef13433d42eE", scope: !69, file: !68, line: 398, type: !76, isLocal: true, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !4, retainedNodes: !4)
!68 = !DIFile(filename: "/home/xftroxgpx/build/2nonpkgs/rust.stuff/rust/rust/src/libstd/sys/unix/process/process_common.rs", directory: "")
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !70, file: !2, size: 8, align: 8, elements: !74, templateParams: !4, identifier: "e58ae212ecf4ec40cffe100c684b5442")
!70 = !DINamespace(name: "process_common", scope: !71)
!71 = !DINamespace(name: "process", scope: !72)
!72 = !DINamespace(name: "unix", scope: !73)
!73 = !DINamespace(name: "sys", scope: !37)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !69, file: !2, baseType: !20, size: 8, align: 8)
!76 = !DISubroutineType(types: !77)
!77 = !{!61, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !69, size: 64, align: 64)
!79 = !DILocalVariable(name: "self", arg: 1, scope: !67, file: !47, line: 1, type: !78)
!80 = !DILocation(line: 1, scope: !67)
!81 = !DILocation(line: 399, column: 8, scope: !67)
!82 = !DILocation(line: 400, column: 5, scope: !67)
!83 = distinct !DISubprogram(name: "new<i32>", linkageName: "_ZN4core3fmt10ArgumentV13new17ha07a9e20c23a5afcE", scope: !85, file: !84, line: 269, type: !162, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !168, retainedNodes: !4)
!84 = !DIFile(filename: "/home/xftroxgpx/build/2nonpkgs/rust.stuff/rust/rust/src/libcore/fmt/mod.rs", directory: "")
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !27, file: !2, size: 128, align: 64, elements: !86, templateParams: !4, identifier: "5e18274617ade21ced14d10ef163ba17")
!86 = !{!87, !109}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !85, file: !2, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Void", baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Void", scope: !27, file: !2, align: 8, elements: !90, templateParams: !4, identifier: "cc2b21611175c49275430a0fdd310e45")
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_priv", scope: !89, file: !2, baseType: !45, align: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_oibit_remover", scope: !89, file: !2, baseType: !93, align: 8)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*mut Fn<()>>", scope: !94, file: !2, align: 8, elements: !4, templateParams: !95, identifier: "74e06a68ebaa3ab1b76ae2842be3300c")
!94 = !DINamespace(name: "marker", scope: !19)
!95 = !{!96}
!96 = !DITemplateTypeParameter(name: "T", type: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut Fn<()>", scope: !98, file: !2, size: 128, align: 64, elements: !100, templateParams: !4, identifier: "903f27233fd787a29974e07c148b7100")
!98 = !DINamespace(name: "function", scope: !99)
!99 = !DINamespace(name: "ops", scope: !19)
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !97, file: !2, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !20, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !97, file: !2, baseType: !104, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !105, size: 64, align: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 192, align: 64, elements: !107)
!106 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!107 = !{!108}
!108 = !DISubrange(count: 3)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !85, file: !2, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::Void, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!17, !88, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !114, size: 64, align: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !27, file: !2, size: 768, align: 64, elements: !115, templateParams: !4, identifier: "c77759b178e1bad246e43e6c7a1b6ac5")
!115 = !{!116, !118, !120, !121, !137, !138, !143, !157}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !114, file: !2, baseType: !117, size: 32, align: 32, offset: 640)
!117 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !114, file: !2, baseType: !119, size: 32, align: 32, offset: 672)
!119 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !114, file: !2, baseType: !24, size: 8, align: 8, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !114, file: !2, baseType: !122, size: 128, align: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !123, file: !2, size: 128, align: 64, elements: !124, identifier: "f5b3bcaa2d8b93ac6128b1ef67cb4b6")
!123 = !DINamespace(name: "option", scope: !19)
!124 = !{!125}
!125 = !DICompositeType(tag: DW_TAG_variant_part, scope: !123, file: !2, size: 128, align: 64, elements: !126, templateParams: !129, identifier: "f5b3bcaa2d8b93ac6128b1ef67cb4b6", discriminator: !135)
!126 = !{!127, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !125, file: !2, baseType: !128, size: 128, align: 64, extraData: i64 0)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !122, file: !2, size: 128, align: 64, elements: !4, templateParams: !129, identifier: "f5b3bcaa2d8b93ac6128b1ef67cb4b6::None")
!129 = !{!130}
!130 = !DITemplateTypeParameter(name: "T", type: !106)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !125, file: !2, baseType: !132, size: 128, align: 64, extraData: i64 1)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !122, file: !2, size: 128, align: 64, elements: !133, templateParams: !129, identifier: "f5b3bcaa2d8b93ac6128b1ef67cb4b6::Some")
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !132, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !2, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!136 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !114, file: !2, baseType: !122, size: 128, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !114, file: !2, baseType: !139, size: 128, align: 64, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut Write", scope: !27, file: !2, size: 128, align: 64, elements: !140, templateParams: !4, identifier: "538dbfd5433239e76384a5faeb7a29b2")
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !139, file: !2, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !139, file: !2, baseType: !104, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "curarg", scope: !114, file: !2, baseType: !144, size: 128, align: 64, offset: 384)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<core::fmt::ArgumentV1>", scope: !145, file: !2, size: 128, align: 64, elements: !146, templateParams: !155, identifier: "87e592eba3a58b20b37977332659b930")
!145 = !DINamespace(name: "slice", scope: !19)
!146 = !{!147, !149, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !144, file: !2, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::ArgumentV1", baseType: !85, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !144, file: !2, baseType: !148, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !144, file: !2, baseType: !151, align: 8)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&core::fmt::ArgumentV1>", scope: !94, file: !2, align: 8, elements: !4, templateParams: !152, identifier: "6c8ab2d60ef01eaad4240f5eaf3140c8")
!152 = !{!153}
!153 = !DITemplateTypeParameter(name: "T", type: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::ArgumentV1", baseType: !85, size: 64, align: 64)
!155 = !{!156}
!156 = !DITemplateTypeParameter(name: "T", type: !85)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !114, file: !2, baseType: !158, size: 128, align: 64, offset: 512)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !159, templateParams: !4, identifier: "159098df5e43096fb525b62f61628279")
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !158, file: !2, baseType: !148, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !158, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!85, !164, !165}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !61, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&i32, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!17, !164, !113}
!168 = !{!169}
!169 = !DITemplateTypeParameter(name: "T", type: !61)
!170 = !DILocalVariable(name: "x", arg: 1, scope: !83, file: !47, line: 1, type: !164)
!171 = !DILocation(line: 1, scope: !83)
!172 = !DILocalVariable(name: "f", arg: 2, scope: !83, file: !47, line: 1, type: !165)
!173 = !DILocation(line: 273, column: 42, scope: !174)
!174 = distinct !DILexicalBlock(scope: !83, file: !84, line: 271, column: 8)
!175 = !DILocation(line: 273, column: 27, scope: !174)
!176 = !DILocation(line: 274, column: 38, scope: !174)
!177 = !DILocation(line: 274, column: 23, scope: !174)
!178 = !DILocation(line: 272, column: 12, scope: !174)
!179 = !DILocation(line: 277, column: 5, scope: !83)
!180 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h2b19ce393e6a9113E", scope: !182, file: !181, line: 144, type: !166, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !4, retainedNodes: !4)
!181 = !DIFile(filename: "/home/xftroxgpx/build/2nonpkgs/rust.stuff/rust/rust/src/libcore/fmt/num.rs", directory: "")
!182 = !DINamespace(name: "{{impl}}", scope: !183)
!183 = !DINamespace(name: "num", scope: !27)
!184 = !DILocalVariable(name: "self", arg: 1, scope: !180, file: !47, line: 1, type: !164)
!185 = !DILocation(line: 1, scope: !180)
!186 = !DILocalVariable(name: "f", arg: 2, scope: !180, file: !47, line: 1, type: !113)
!187 = !DILocation(line: 145, column: 19, scope: !180)
!188 = !DILocation(line: 145, column: 16, scope: !180)
!189 = !DILocation(line: 146, column: 39, scope: !180)
!190 = !DILocation(line: 146, column: 45, scope: !180)
!191 = !DILocation(line: 146, column: 20, scope: !180)
!192 = !DILocation(line: 147, column: 26, scope: !180)
!193 = !DILocation(line: 147, column: 23, scope: !180)
!194 = !DILocation(line: 148, column: 39, scope: !180)
!195 = !DILocation(line: 148, column: 45, scope: !180)
!196 = !DILocation(line: 148, column: 20, scope: !180)
!197 = !DILocation(line: 150, column: 38, scope: !180)
!198 = !DILocation(line: 150, column: 44, scope: !180)
!199 = !DILocation(line: 150, column: 20, scope: !180)
!200 = !DILocation(line: 152, column: 13, scope: !180)
!201 = !{i8 0, i8 2}
!202 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17hf39008b85d5fa536E", scope: !203, file: !84, line: 323, type: !272, isLocal: true, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !4, retainedNodes: !4)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !27, file: !2, size: 384, align: 64, elements: !204, templateParams: !4, identifier: "f868a333fcdc68afb00d41f34d6c3cce")
!204 = !{!205, !215, !271}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !203, file: !2, baseType: !206, size: 128, align: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !207, templateParams: !4, identifier: "6dc4ddb2dbcf2912a5f3983b5bf0572")
!207 = !{!208, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !206, file: !2, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !210, size: 64, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !211, templateParams: !4, identifier: "111094d970b097647de579f9c509ef08")
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !210, file: !2, baseType: !42, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !210, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !206, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !203, file: !2, baseType: !216, size: 128, align: 64, offset: 128)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !123, file: !2, size: 128, align: 64, elements: !217, identifier: "ed1c18fe97708514bc2c395ee79b5fb6")
!217 = !{!218}
!218 = !DICompositeType(tag: DW_TAG_variant_part, scope: !123, file: !2, size: 128, align: 64, elements: !219, templateParams: !222, identifier: "ed1c18fe97708514bc2c395ee79b5fb6", discriminator: !135)
!219 = !{!220, !267}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !218, file: !2, baseType: !221, size: 128, align: 64, extraData: i64 0)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !216, file: !2, size: 128, align: 64, elements: !4, templateParams: !222, identifier: "ed1c18fe97708514bc2c395ee79b5fb6::None")
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "T", type: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !225, templateParams: !4, identifier: "f14718cb2189b8b9fd82564d5b380230")
!225 = !{!226, !266}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !224, file: !2, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::rt::v1::Argument", baseType: !228, size: 64, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !25, file: !2, size: 512, align: 64, elements: !229, templateParams: !4, identifier: "aa05deb2603ed963f3df1b4616728858")
!229 = !{!230, !242}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !228, file: !2, baseType: !231, size: 128, align: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Position", scope: !25, file: !2, size: 128, align: 64, elements: !232, identifier: "e2413f653bbd1f0d42eb753923cf5ee8")
!232 = !{!233}
!233 = !DICompositeType(tag: DW_TAG_variant_part, scope: !25, file: !2, size: 128, align: 64, elements: !234, templateParams: !4, identifier: "e2413f653bbd1f0d42eb753923cf5ee8", discriminator: !241)
!234 = !{!235, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !233, file: !2, baseType: !236, size: 128, align: 64, extraData: i64 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Next", scope: !231, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "e2413f653bbd1f0d42eb753923cf5ee8::Next")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "At", scope: !233, file: !2, baseType: !238, size: 128, align: 64, extraData: i64 1)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "At", scope: !231, file: !2, size: 128, align: 64, elements: !239, templateParams: !4, identifier: "e2413f653bbd1f0d42eb753923cf5ee8::At")
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !238, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, scope: !25, file: !2, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !228, file: !2, baseType: !243, size: 384, align: 64, offset: 128)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !25, file: !2, size: 384, align: 64, elements: !244, templateParams: !4, identifier: "f67f91e932d084762031c544a5494060")
!244 = !{!245, !246, !247, !248, !265}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !243, file: !2, baseType: !119, size: 32, align: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !243, file: !2, baseType: !24, size: 8, align: 8, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !2, baseType: !117, size: 32, align: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !243, file: !2, baseType: !249, size: 128, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !25, file: !2, size: 128, align: 64, elements: !250, identifier: "291b503487179e15948bf1b76dc05902")
!250 = !{!251}
!251 = !DICompositeType(tag: DW_TAG_variant_part, scope: !25, file: !2, size: 128, align: 64, elements: !252, templateParams: !4, identifier: "291b503487179e15948bf1b76dc05902", discriminator: !241)
!252 = !{!253, !257, !261, !263}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !251, file: !2, baseType: !254, size: 128, align: 64, extraData: i64 0)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !249, file: !2, size: 128, align: 64, elements: !255, templateParams: !4, identifier: "291b503487179e15948bf1b76dc05902::Is")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !254, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !251, file: !2, baseType: !258, size: 128, align: 64, extraData: i64 1)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !249, file: !2, size: 128, align: 64, elements: !259, templateParams: !4, identifier: "291b503487179e15948bf1b76dc05902::Param")
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !258, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "NextParam", scope: !251, file: !2, baseType: !262, size: 128, align: 64, extraData: i64 2)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "NextParam", scope: !249, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "291b503487179e15948bf1b76dc05902::NextParam")
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !251, file: !2, baseType: !264, size: 128, align: 64, extraData: i64 3)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !249, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "291b503487179e15948bf1b76dc05902::Implied")
!265 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !243, file: !2, baseType: !249, size: 128, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !224, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !218, file: !2, baseType: !268, size: 128, align: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !216, file: !2, size: 128, align: 64, elements: !269, templateParams: !222, identifier: "ed1c18fe97708514bc2c395ee79b5fb6::Some")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !268, file: !2, baseType: !224, size: 128, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !203, file: !2, baseType: !158, size: 128, align: 64, offset: 256)
!272 = !DISubroutineType(types: !273)
!273 = !{!203, !206, !158, !224}
!274 = !DILocalVariable(name: "pieces", arg: 1, scope: !202, file: !47, line: 1, type: !206)
!275 = !DILocation(line: 1, scope: !202)
!276 = !DILocalVariable(name: "args", arg: 2, scope: !202, file: !47, line: 1, type: !158)
!277 = !DILocalVariable(name: "fmt", arg: 3, scope: !202, file: !47, line: 1, type: !224)
!278 = !DILocation(line: 327, column: 12, scope: !202)
!279 = !DILocation(line: 328, column: 22, scope: !202)
!280 = !DILocation(line: 328, column: 17, scope: !202)
!281 = !DILocation(line: 329, column: 12, scope: !202)
!282 = !DILocation(line: 326, column: 8, scope: !202)
!283 = !DILocation(line: 331, column: 5, scope: !202)
!284 = distinct !DISubprogram(name: "call_once<closure,()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17ha578c1ab5205ecd5E", scope: !286, file: !285, line: 231, type: !287, isLocal: true, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !289, retainedNodes: !4)
!285 = !DIFile(filename: "/home/xftroxgpx/build/2nonpkgs/rust.stuff/rust/rust/src/libcore/ops/function.rs", directory: "")
!286 = !DINamespace(name: "FnOnce", scope: !98)
!287 = !DISubroutineType(types: !288)
!288 = !{!61, !5}
!289 = !{!290, !291}
!290 = !DITemplateTypeParameter(name: "Self", type: !5)
!291 = !DITemplateTypeParameter(name: "Args", type: !45)
!292 = !DILocalVariable(arg: 1, scope: !284, file: !47, line: 1, type: !5)
!293 = !DILocation(line: 1, scope: !284)
!294 = !DILocalVariable(arg: 2, scope: !284, file: !47, line: 1, type: !45)
!295 = !DILocation(line: 231, column: 4, scope: !284)
!296 = distinct !DISubprogram(name: "call_once<closure,()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once32_$u7b$$u7b$vtable.shim$u7d$$u7d$17h00bb45de9c0b046aE", scope: !286, file: !285, line: 231, type: !297, isLocal: true, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !289, retainedNodes: !4)
!297 = !DISubroutineType(types: !298)
!298 = !{!61, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut closure", baseType: !5, size: 64, align: 64)
!300 = !DILocalVariable(arg: 1, scope: !296, file: !47, line: 1, type: !299)
!301 = !DILocation(line: 1, scope: !296)
!302 = !DILocalVariable(arg: 2, scope: !296, file: !47, line: 1, type: !45)
!303 = !DILocation(line: 231, column: 4, scope: !296)
!304 = distinct !DISubprogram(name: "real_drop_in_place<closure>", linkageName: "_ZN4core3ptr18real_drop_in_place17h90c7b6ca8f2d7accE", scope: !306, file: !305, line: 193, type: !307, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !310, retainedNodes: !4)
!305 = !DIFile(filename: "/home/xftroxgpx/build/2nonpkgs/rust.stuff/rust/rust/src/libcore/ptr.rs", directory: "")
!306 = !DINamespace(name: "ptr", scope: !19)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut closure", baseType: !5, size: 64, align: 64)
!310 = !{!311}
!311 = !DITemplateTypeParameter(name: "T", type: !5)
!312 = !DILocalVariable(arg: 1, scope: !304, file: !47, line: 1, type: !309)
!313 = !DILocation(line: 1, scope: !304)
!314 = !DILocation(line: 193, scope: !304)
!315 = distinct !DISubprogram(name: "report", linkageName: "_ZN54_$LT$$LP$$RP$$u20$as$u20$std..process..Termination$GT$6report17h7fcb6e908fc010e9E", scope: !317, file: !316, line: 1589, type: !319, isLocal: true, isDefinition: true, scopeLine: 1589, flags: DIFlagPrototyped, isOptimized: false, unit: !14, templateParams: !4, retainedNodes: !4)
!316 = !DIFile(filename: "/home/xftroxgpx/build/2nonpkgs/rust.stuff/rust/rust/src/libstd/process.rs", directory: "")
!317 = !DINamespace(name: "{{impl}}", scope: !318)
!318 = !DINamespace(name: "process", scope: !37)
